[
  {
    "Authors": "Maciej Tomczak (Birmingham City University)*; Min Susan Li (University of Birmingham); Massimiliano Di Luca (University of Birmingham)",
    "abstract": "In this paper we present Virtuoso Strings, a dataset for timing analysis and automatic music transcription (AMT) tasks requiring note onset annotations. This dataset takes advantage of real-world recordings in multitrack format and is curated as part of the Augmented Reality Music Ensemble (ARME) project which investigates musician synchronisation and multimodal music analysis. The dataset is comprised of repeated recordings of quartet, trio, duet and solo ensemble performances with different temporal expressions and leadership role assignments, providing new possibilities for developing and evaluating AMT models with respect to diverse musical performance styles. To reduce the cost of the labour-intensive manual annotation, a semi-automatic method was utilised for both annotation and quality control. The presented dataset consists of 746 tracks with a total of 68,728 onsets. Every track includes onset annotations for a single string instrument, enabling the creation of audio files with different combinations of instruments to be used in the AMT evaluation process.",
    "affiliation": "Birmingham City University | University of Birmingham",
    "authors": "Tomczak, Maciej*; Li, Min Susan; Di Luca, Massimiliano",
    "authors_emails": "maciej.tomczak@bcu.ac.uk*; m.li.9@bham.ac.uk; M.DiLuca@bham.ac.uk",
    "channel_name": "lp-1-tomczak",
    "channel_url": "https://slack.com/app_redirect?channel=C064C28K0V7",
    "paper_link": "https://drive.google.com/file/d/1FrjpqyGu4Wl3Oj5WsxA6_1fkmVqRjrEu/preview",
    "position": "1",
    "poster_link": "",
    "primary_author": "Maciej Tomczak",
    "primary_email": "maciej.tomczak@bcu.ac.uk",
    "session": "Physical",
    "thumbnail_link": "001.png",
    "title": "Virtuoso Strings: A Dataset of String Ensemble Recordings and Onset Annotations for Timing Analysis",
    "uid": "312",
    "youtube_id": ""
  },
  {
    "Authors": "Masatoshi Hamanaka (RIKEN)*",
    "abstract": "We present Music Scope Pad, an application for efficiently discovering what one wants to view among many unknown music videos (MVs). Current video players only enable the user to view one MV at a time, so to explore what the user wants to view among many unknown MVs, they need to play each MV individually, which requires a large amount of manipulation. Our app features artificial-intelligence processing of video acquired with the device's front camera to detect the natural movements of the user's head and hands while listening to music, enabling the user to explore MVs. Ten MVs are played simultaneously on the iPad screen and through the spatial acoustics of the device. The user can then explore the MVs they want to view by moving their head left or right. The volume of each MV through the spatial acoustics is automatically adjusted so that the MVs closer to the center of the screen are louder. If the user then cups their hands around their ears, as if they were listening carefully, they can hear the MVs directly in front of them on the screen through the spatial acoustics with more emphasis. If the user keeps their focus on one MV for more than three seconds, that MV will be selected and only that video will be played from the beginning. ",
    "affiliation": "RIKEN",
    "authors": "Hamanaka, Masatoshi*",
    "authors_emails": "masatoshi.hamanaka@riken.jp*",
    "channel_name": "lp-2-hamanaka",
    "channel_url": "https://slack.com/app_redirect?channel=C063ZAMPRNF",
    "paper_link": "https://drive.google.com/file/d/1m8FshdzWL7Enl8ASaVDxms__LAlWbypR/preview",
    "position": "2",
    "poster_link": "",
    "primary_author": "Masatoshi Hamanaka",
    "primary_email": "masatoshi.hamanaka@riken.jp",
    "session": "Physical",
    "thumbnail_link": "002.png",
    "title": "Music Scope Pad",
    "uid": "315",
    "youtube_id": "https://drive.google.com/uc?export=view&id=1UzC_0f_qtntgvnpkkpf-wkvVGVqrwM9q"
  },
  {
    "Authors": "David Cabrera Dalmazzo (KTH)*; Ken Déguernel (Univ. Lille, CNRS, Centrale Lille); Bob L. T.  Sturm (KTH Royal Institute of Technology)",
    "abstract": "This paper presents a transformer machine-learning model trained with a large dataset of chord sequences. The dataset includes several styles, such as jazz, rock, pop, blues, or music for cinema, among others. We investigated three modeling strategies: 1) We started the tokenization method by treating all different chords as unique elements, which resulted in a vocabulary of 5202 independent chords as tokens. 2) We expressed the chords as a tuple describing root, nature (e.g., major, minor, diminished, major seventh), and extensions (e.g., additions, alterations), which produces a vocabulary of 59 tokens. 3) We extended the second model by complementing the transformer model with chord information containing eight MIDI notes added to the positional embeddings. We analyze sequences generated by comparing them with the training dataset using trigram analysis, which reveals common chord progressions and source duplications. Secondly, we compared the generated sequences from a musical perspective, rating their plausibility concerning the training data. The third strategy reported lower validation loss and more musical consistency in the suggested progressions.",
    "affiliation": "KTH Royal Institute of Technology | Univ. Lille, CNRS, Centrale Lille | KTH",
    "authors": "Cabrera Dalmazzo, David*; Déguernel, Ken; Sturm, Bob L. T. ",
    "authors_emails": "dalmazzo@kth.se*; ken.deguernel@cnrs.fr; bobs@kth.se",
    "channel_name": "lp-3-dalmazzo",
    "channel_url": "https://slack.com/app_redirect?channel=C063ZDGD49G",
    "paper_link": "https://drive.google.com/file/d/14xEoj_bGwcHCBlzX0zhZpmWIz9y2v816/preview",
    "position": "3",
    "poster_link": "https://drive.google.com/file/d/1dhgnb5AIjfxHmZsAYQotRyOZ_6p8UORH/preview",
    "primary_author": "David Cabrera Dalmazzo",
    "primary_email": "dalmazzo@kth.se",
    "session": "Physical",
    "thumbnail_link": "003.png",
    "title": "The Chordinator: Chord Progression Modeling and Generation using Transformers",
    "uid": "316",
    "youtube_id": "https://drive.google.com/uc?export=view&id=1k0C-uFmAnG-ma2nDWvc9DgdrfRIiGlAz"
  },
  {
    "Authors": "Laura Cros Vila (KTH)*; Bob L. T.  Sturm (KTH Royal Institute of Technology)",
    "abstract": "Cornelissen et al. (2021) propose representing melodic contour using a linear combination of few cosine functions for a variety of tasks such as visualization, classification and summarization. The authors apply this representation to studying melodies from four traditions (Gregorian chant, German, Chinese and Sioux folk songs) and claim that it provides a common ground for comparing contours across traditions due to its being data independent, i.e., culturally neutral. We study this claim in the domain of Irish Traditional Dance Music and find evidence that challenges its veracity. Specifically, we find that the cosine representation of the melodic contours of this music is not nearly as efficient as it is for the other traditions. We contrast this representation with a principal component analysis of the melodic contours. Our work contributes to a more nuanced understanding of cosine-based representations of melodic contour.",
    "affiliation": "KTH Royal Institute of Technology | KTH",
    "authors": "Cros Vila, Laura*; Sturm, Bob L. T. ",
    "authors_emails": "lcros@kth.se*; bobs@kth.se",
    "channel_name": "lp-4-vila",
    "channel_url": "https://slack.com/app_redirect?channel=C063ZAN3PA7",
    "paper_link": "https://drive.google.com/file/d/1PBHtPvmTiGQjxySUe0ZDa-4IoWvNANLI/preview",
    "position": "4",
    "poster_link": "https://drive.google.com/file/d/1U0Vp26MUYUH5pyMqRLFYSqGZUNe-jWfr/preview",
    "primary_author": "Laura Cros Vila",
    "primary_email": "lcros@kth.se",
    "session": "Physical",
    "thumbnail_link": "004.png",
    "title": "Cosine Contours: A Case Study with Melodies from Irish Traditional Dance Music",
    "uid": "318",
    "youtube_id": ""
  },
  {
    "Authors": "Sihun Lee (Sogang University)*; Dasaem Jeong (Sogang University)",
    "abstract": "Rhythm-based video games challenge players to match their actions with musical cues, turning songs into interactive experiences. The design of the game charts, which dictate the timing and placement of on-screen notes, are manually crafted by players and developers. With AutoOsu, we introduce a CRNN-based model for generating rhythm game charts for a given audio track, conditioned on an intended difficulty level. In previous studies, this task is often divided into two: onset detection, which determines timing points for notes; and action generation, where notes are distributed among a set of available keys. These two sub-tasks are typically handled with two separately trained models, and audio information is only given to the onset detection model. We instead jointly train the two recurrent layers who both receive audio information, which streamlines the training process and helps better utilize musical features.",
    "affiliation": "Sogang University",
    "authors": "Lee, Sihun*; Jeong, Dasaem",
    "authors_emails": "tastyvb@sogang.ac.kr*; dasaemj@sogang.ac.kr",
    "channel_name": "lp-5-lee",
    "channel_url": "https://slack.com/app_redirect?channel=C063WFRT50D",
    "paper_link": "https://drive.google.com/file/d/1zdgVPPRPBEueRfVDUl5yBUWrh_eWAJ3O/preview",
    "position": "5",
    "poster_link": "https://drive.google.com/file/d/1slXIcNaKQqbtS0SAECSHMToK37qzi37-/preview",
    "primary_author": "Sihun Lee",
    "primary_email": "tastyvb@sogang.ac.kr",
    "session": "Physical",
    "thumbnail_link": "005.png",
    "title": "AutoOsu: Audio-Aware Action Generation for Rhythm Games",
    "uid": "319",
    "youtube_id": "https://drive.google.com/uc?export=view&id=1t4NXtS80VY-8kQboqeV0789Ie8buPBF1"
  },
  {
    "Authors": "Nadine Kroher (Time Machine Capital 2 ); Helena Cuesta (DAACI)*; Aggelos Pikrakis (Time Machine Capital 2)",
    "abstract": "We are investigating the broader concept of using AI-based generative music systems to generate training data for Music Information Retrieval (MIR) tasks. To kick off this line of work, we ran an initial experiment in which we trained a genre classifier on a fully artificial music dataset created with MusicGen. We constructed over 50 000 genre-conditioned textual descriptions and generated a collection of music excerpts that covers five musical genres. Our preliminary results show that the proposed model can learn genre-specific characteristics from artificial music tracks that generalise well to real-world music recordings.",
    "affiliation": "Time Machine Capital 2 | Time Machine Capital 2  | DAACI",
    "authors": "Kroher, Nadine; Cuesta, Helena*; Pikrakis, Aggelos",
    "authors_emails": "nadine@tmc2.ai; helena@daaci.com*; aggelos@tmc2.ai",
    "channel_name": "lp-6-cuesta",
    "channel_url": "https://slack.com/app_redirect?channel=C063WFS2021",
    "paper_link": "https://drive.google.com/file/d/16LUDN42VsaUa1Nhp106Gbagpxk4CduC9/preview",
    "position": "6",
    "poster_link": "https://drive.google.com/file/d/1kk2_IVl3-7H6QKDnZyB2u4o-lHNpoQuL/preview",
    "primary_author": "Helena Cuesta",
    "primary_email": "helena@daaci.com",
    "session": "Physical",
    "thumbnail_link": "006.png",
    "title": "Can MusicGen Create Training Data for MIR Tasks?",
    "uid": "320",
    "youtube_id": ""
  },
  {
    "Authors": "Andrew C Edwards (QMUL)*; Simon Dixon (Queen Mary University of London); Akira Maezawa (Yamaha Corporation); Yuta Kusaka (Yamaha Corporation)",
    "abstract": "A method and apparatus is described for generating and recording acoustic piano performances automatically and at scale.  This technique has generated nearly 500 hours of studio piano recordings, including a complete re-recording of the MAESTRO solo piano dataset. A software utility has been implemented to simultaneously manage MIDI playback on a Yamaha Diskalvier and a synchronized audio capture session. As part of this late-breaking demo, we release the re-recorded studio audio for the MAESTRO Studio dataset and the Python software package piano-capture used for automating data collection. As well as adding to the pool of existing training data for MIR tasks such as transcription and audio-MIDI alignment, this work facilitates the creation of further datasets, for example in other musical styles.",
    "affiliation": "Yamaha Corporation | Queen Mary University of London | QMUL",
    "authors": "Edwards, Andrew C*; Dixon, Simon; Maezawa, Akira; Kusaka, Yuta",
    "authors_emails": "a.c.edwards@qmul.ac.uk*; s.e.dixon@qmul.ac.uk; akira.maezawa@music.yamaha.com; yuta.kusaka@music.yamaha.com",
    "channel_name": "lp-7-edwards",
    "channel_url": "https://slack.com/app_redirect?channel=C064C2UQ38R",
    "paper_link": "https://drive.google.com/file/d/15_Fnl0FibQ6Jp8XvHCJc8fTbZYl4Btf9/preview",
    "position": "7",
    "poster_link": "https://drive.google.com/file/d/1SCuNRk58yaW1BAnvrd_wjsBI9Cs845fw/preview",
    "primary_author": "Andrew C Edwards",
    "primary_email": "a.c.edwards@qmul.ac.uk",
    "session": "Physical",
    "thumbnail_link": "007.png",
    "title": "AUTOMATIC PRODUCTION OF ACOUSTIC PIANO TRANSCRIPTION DATA",
    "uid": "321",
    "youtube_id": ""
  },
  {
    "Authors": "Matej Istvanek (Brno University of Technology)*; Stepan Miklanek (Brno University of Technology)",
    "abstract": "Music performance analysis has traditionally been a peripheral topic in the music information retrieval community. However, it is sometimes included in the goals of music information retrieval studies—from low- and high-level parameter detection and synchronization methods to feature selection and measure transfer. In this contribution, we introduce the MemoVision software, which utilizes retrieval and feature selection methods for comparative music analysis. It is built with JavaScript and Python languages, combining the accessibility of a web-based interface and state-of-the-art feature extraction possibilities. Its features can be used separately or as a visualization tool for music performance case studies.",
    "affiliation": "Brno University of Technology",
    "authors": "Istvanek, Matej*; Miklanek, Stepan",
    "authors_emails": "matej.istvanek@vut.cz*; stepan.miklanek@vut.cz",
    "channel_name": "lp-8-istvanek",
    "channel_url": "https://slack.com/app_redirect?channel=C064C2UUDHP",
    "paper_link": "https://drive.google.com/file/d/10a1fbxBS_fTCGeGQYXX2az_1UQT1pTuf/preview",
    "position": "8",
    "poster_link": "https://drive.google.com/file/d/12ltmy5vpCqnniP-hnWMos9sVF_vne7UC/preview",
    "primary_author": "Matej Istvanek",
    "primary_email": "matej.istvanek@vut.cz",
    "session": "Physical",
    "thumbnail_link": "008.png",
    "title": "MemoVision: a tool for feature selection and visualization of performance data",
    "uid": "322",
    "youtube_id": "https://drive.google.com/uc?export=view&id=1W93WTRBKcsOtVSdOPk4aPJovrGVjkmqu"
  },
  {
    "Authors": "Gaël Richard (Telecom Paris, Institut polytechnique de Paris)*; Jose Manuel Gil Panal (Telecom Paris); Aurélien David (Telecom Paris, Institut polytechnique de Paris)",
    "abstract": "The present here the recent development of an online platform for musicians, researchers and an open community of  enthusiasts of audio and music with a view to build a public database of music recordings from a wide variety of styles and different cultures. The data generated and collected will primarily be audio data, coming from various sources, including field recordings, existing datasets, and users’ collaboration. The platform aims at gathering a distributed music crowdsourcing database collection where each music piece is built from asynchronous recordings of different tracks at remote sites. The complete tool and databases generated will be openly distributed for research purpose.",
    "affiliation": "Telecom Paris, Institut polytechnique de Paris | Telecom Paris",
    "authors": "Richard, Gaël*; Gil Panal, Jose Manuel; David, Aurélien",
    "authors_emails": "gael.richard@telecom-paris.fr*; jose.gilpanal@telecom-paris.fr; aurelien.david@telecom-paris.fr",
    "channel_name": "lp-9-richard",
    "channel_url": "https://slack.com/app_redirect?channel=C063ZDH90N6",
    "paper_link": "https://drive.google.com/file/d/1GgMsbMs1AbakAg4SP47OsszU09hsPQv0/preview",
    "position": "9",
    "poster_link": "",
    "primary_author": "Gaël Richard",
    "primary_email": "gael.richard@telecom-paris.fr",
    "session": "Physical",
    "thumbnail_link": "009.png",
    "title": "The Hi-Audio Online Platform for distributed music crowdsourcing database collection",
    "uid": "323",
    "youtube_id": ""
  },
  {
    "Authors": "Keitaro Tanaka (Waseda University)*; Yin-Jyun Luo (Queen Mary University of London); Kin Wai Cheuk (Singapore University of Technology and Design); Kazuyoshi Yoshii (Kyoto University); Shigeo Morishima (Waseda Research Institute for Science and Engineering); Simon Dixon (Queen Mary University of London)",
    "abstract": "This paper investigates training methods for musical instrument recognition (IR). Many studies have tackled IR and improved performance based on limited primary datasets (e.g., the OpenMIC dataset). As such, IR on other datasets, especially small ones, is yet to be studied. We propose to utilize a large synthesized dataset for IR on small datasets with real-world samples. Specifically, we first pre-train a transformer-based model with the Slakh2100 dataset to initialize its weights. We then fine-tune the model by training using the target datasets. We compare our approach with the adaptor approach, widely known as effective in fine-tuning large language models. We also investigate how the IR performance changes when we can access only a limited number of samples from the target dataset. Our experiment shows that the weight initialization performs consistently better than training from scratch and the adaptor approach.",
    "affiliation": "Kyoto University | Waseda Research Institute for Science and Engineering | Waseda University | Singapore University of Technology and Design | Queen Mary University of London",
    "authors": "Tanaka, Keitaro*; Luo, Yin-Jyun; Cheuk, Kin Wai; Yoshii, Kazuyoshi; Morishima, Shigeo; Dixon, Simon",
    "authors_emails": "phys.keitaro1227@ruri.waseda.jp*; yin-jyun.luo@qmul.ac.uk; ravencheuk@gmail.com; yoshii@i.kyoto-u.ac.jp; shigeo@waseda.jp; s.e.dixon@qmul.ac.uk",
    "channel_name": "lp-10-tanaka",
    "channel_url": "https://slack.com/app_redirect?channel=C0641SRQ7MJ",
    "paper_link": "https://drive.google.com/file/d/1MBtS7S8wMRgL7aLE_0ySwCaSvaBVO_cF/preview",
    "position": "10",
    "poster_link": "https://drive.google.com/file/d/10Drq5VqaRIa86jw17kTNeSyYB528GxNs/preview",
    "primary_author": "Keitaro Tanaka",
    "primary_email": "phys.keitaro1227@ruri.waseda.jp",
    "session": "Physical",
    "thumbnail_link": "010.png",
    "title": "On the Use of Synthesized Datasets and Transformer Adaptors for Musical Instrument Recognition",
    "uid": "324",
    "youtube_id": ""
  },
  {
    "Authors": "Ching-Yu Chiu (International Audio Laboratories Erlangen, Germany)*; Meinard Müller (International Audio Laboratories Erlangen)",
    "abstract": "Automated beat tracking is a central task in music information retrieval (MIR) and aims to find time positions that humans would tap a long when listening to music. In a previous contribution, we built upon an existing beat tracking system and evaluated the results on annotated datasets of Western classical music. In our experiments, we obtained poor evaluation results which we first attributed to the complexity of the music. We later discovered that many of the poor results can be traced back to technical issues in the processing pipeline and inaccurate beat annotations. In this contribution, we report on some of these issues and make suggestions regarding visualization and sonification to better understand the data and results.",
    "affiliation": "International Audio Laboratories Erlangen, Germany | International Audio Laboratories Erlangen",
    "authors": "Chiu, Ching-Yu*; Müller, Meinard",
    "authors_emails": "x2009971@gmail.com*; meinard.mueller@audiolabs-erlangen.de",
    "channel_name": "lp-11-chiu",
    "channel_url": "https://slack.com/app_redirect?channel=C063JT7ML07",
    "paper_link": "https://drive.google.com/file/d/16H89T7zTrc8HdLRG1SbHlZ7o6_Tx_IqN/preview",
    "position": "11",
    "poster_link": "https://drive.google.com/file/d/1s4uaz5_ikg9aM21hfl91pwzy9_KPDoMh/preview",
    "primary_author": "Ching-Yu Chiu",
    "primary_email": "x2009971@gmail.com",
    "session": "Physical",
    "thumbnail_link": "011.png",
    "title": "What can go wrong when conducting beat tracking experiments",
    "uid": "325",
    "youtube_id": ""
  },
  {
    "Authors": "Seolhee Lee (KAIST)*; Eunjin Choi (KAIST); Joonhyung Bae (KAIST); Hyerin Kim (Sogang); Eita Nakamura (Kyoto University); Dasaem Jeong (Sogang University); Juhan Nam (KAIST)",
    "abstract": "The improvement of automatic transcription algorithms has led to the accessibility of high-quality symbolic music data aligned with audio, especially for piano music. However, the transcribed MIDI files need extra annotation, such as beat, chord, and structure, to utilize the dataset in other MIR tasks, such as automatic music composition, melody harmonization, and harmonic analysis. Music annotations, especially chord annotations, need high-level music domain knowledge. Although there are a handful of algorithms for chord annotation, the prediction accuracy is limited. Therefore, it needs humans to correct the annotation eventually. We suggest a web-based semi-automated chord annotation tool for piano music to facilitate this validation process conveniently. We integrated the previous piano music transcription, alignment, quantization, and chord annotation research into one system. Given piano audio input, users can modify the predicted chord annotation of converted MIDI. The demo page is available in our website.",
    "affiliation": "Sogang | Sogang University | KAIST | Kyoto University",
    "authors": "Lee, Seolhee*; Choi, Eunjin; Bae, Joonhyung; Kim, Hyerin; Nakamura, Eita; Jeong, Dasaem; Nam, Juhan",
    "authors_emails": "seolhee_lee@kaist.ac.kr*; jech@kaist.ac.kr; jh.bae@kaist.ac.kr; kime0225@sogang.ac.kr; eita.nakamura@i.kyoto-u.ac.jp; dasaemj@sogang.ac.kr; juhan.nam@kaist.ac.kr",
    "channel_name": "lp-12-lee",
    "channel_url": "https://slack.com/app_redirect?channel=C063WFSSCR3",
    "paper_link": "https://drive.google.com/file/d/1mGMsClAjyqaM0eExnE0rfVan2vfhG3kK/preview",
    "position": "12",
    "poster_link": "https://drive.google.com/file/d/1VaTDENC9RRgtBdKqfi9nZ607gnieN_Cg/preview",
    "primary_author": "Seolhee Lee",
    "primary_email": "seolhee_lee@kaist.ac.kr",
    "session": "Physical",
    "thumbnail_link": "012.png",
    "title": "Bridging Audio and Symbolic Piano Data through a Web-Based Annotation Interface",
    "uid": "326",
    "youtube_id": "https://drive.google.com/uc?export=view&id=1H42Kd_17CefAuktH_lcHtyaQGGM6L-lI"
  },
  {
    "Authors": "Hans-Ulrich Berendes (International Audio Laboratories Erlangen); Simon J Schwär (International Audio Laboratories Erlangen)*; Maximilian Schäfer (Digital Communications, Friedrich-Alexander-Universität Erlangen-Nürnberg (FAU)); Meinard Müller (International Audio Laboratories Erlangen)",
    "abstract": "We explore the concept of combining physical modeling of the piano with deep learning using methods from differentiable digital signal processing. The core of our proposed approach is a  modal synthesis model for the piano string, which is combined with a linear filter to approximate the acoustic properties of a grand piano. In a preliminary experiment, we train a neural network to estimate an excitation signal for a string in an autoencoder setting and show that the system can match the spectral content of a given target note. Our differentiable piano model could be utilized in a multitude of music processing tasks, including sound matching, signal enhancement, or source separation.",
    "affiliation": "FAU | International Audio Laboratories Erlangen",
    "authors": "Berendes, Hans-Ulrich; Schwär, Simon J*; Schäfer, Maximilian; Müller, Meinard",
    "authors_emails": "uli.berendes@fau.de; simon.schwaer@audiolabs-erlangen.de*; max.schaefer@fau.de; meinard.mueller@audiolabs-erlangen.de",
    "channel_name": "lp-13-schwär",
    "channel_url": "https://slack.com/app_redirect?channel=C063ZAPBC3V",
    "paper_link": "https://drive.google.com/file/d/1YVe1LUEwdjoSbZ3RUQBXCQEUu1mPxeND/preview",
    "position": "13",
    "poster_link": "https://drive.google.com/file/d/14s0unpCZlwjthBNBY-8rjVF0StsUjTvT/preview",
    "primary_author": "Simon J Schwär",
    "primary_email": "simon.schwaer@audiolabs-erlangen.de",
    "session": "Physical",
    "thumbnail_link": "013.png",
    "title": "Towards Differentiable Piano Synthesis Based On Physical Modeling",
    "uid": "327",
    "youtube_id": ""
  },
  {
    "Authors": "Taejun Kim (KAIST); Juhan Nam (KAIST)*",
    "abstract": "There have been many attempts to build automatic DJ systems in both industry and academia. However, these often focus solely on track selection and mixing, neglecting the importance of music structure and mix point selection—key elements for determining transition points to the next track. We introduce a web demonstration, DJ StructFreak, which prioritizes mix point selection and music structures. The system identifies the best matching segment for user-selected mix points using music structure embeddings. As a result, it offers a continuous music listening experience and a new level of freedom for users in mix point selection. DJ StructFreak will be accessible via a link provided upon acceptance.",
    "affiliation": "KAIST",
    "authors": "Kim, Taejun; Nam, Juhan*",
    "authors_emails": "taejun@kaist.ac.kr; juhan.nam@kaist.ac.kr*",
    "channel_name": "lp-14-nam",
    "channel_url": "https://slack.com/app_redirect?channel=C063JT8564X",
    "paper_link": "https://drive.google.com/file/d/1fbwMeFUp2c8lTTsEmsJxhSkp3o5otijk/preview",
    "position": "14",
    "poster_link": "",
    "primary_author": "Juhan Nam",
    "primary_email": "juhan.nam@kaist.ac.kr",
    "session": "Physical",
    "thumbnail_link": "014.png",
    "title": "DJ StructFreak: Automatic DJ system Built with Music Structure Embeddings",
    "uid": "328",
    "youtube_id": "https://drive.google.com/uc?export=view&id=1aD8P_h7GWDvTsIRHnD8qNFeO7hCTEAGM"
  },
  {
    "Authors": "Luca Casini (KTH Royal Institute of Technology)*; Nicolas Jonason (KTH Royal Institute of Technology ); Bob L. T.  Sturm (KTH Royal Institute of Technology)",
    "abstract": "We present ``abcMLM,'' a masked language model for generating folk-like music that permits a wider range of possibilities compared to autoregressive approaches.  It has similar performance to autoregressive approaches overall,  albeit with a few peculiarities arising from a different training objective.  We demonstrate abcMLM and its different interaction modalities, and discuss its trade-offs in relation to autoregressive modeling.",
    "affiliation": "KTH Royal Institute of Technology | KTH Royal Institute of Technology ",
    "authors": "Casini, Luca*; Jonason, Nicolas; Sturm, Bob L. T. ",
    "authors_emails": "casini@kth.se*; njona@kth.se; bobs@kth.se",
    "channel_name": "lp-15-casini",
    "channel_url": "https://slack.com/app_redirect?channel=C063ZDJ4T3L",
    "paper_link": "https://drive.google.com/file/d/12pm_LN6s5t85cWbD_iCZTtqk0R3C1NoN/preview",
    "position": "15",
    "poster_link": "https://drive.google.com/file/d/1Sjn6Ry-gVC8qFH4oS2Thuvm4dJnwsw6m/preview",
    "primary_author": "Luca Casini",
    "primary_email": "casini@kth.se",
    "session": "Physical",
    "thumbnail_link": "015.png",
    "title": "Generating folk-like music in abc-notation with Masked Language Models",
    "uid": "329",
    "youtube_id": ""
  },
  {
    "Authors": "Ashvala Vinay (Georgia Institute of Technology)*; Alexander Lerch (Georgia Institute of Technology)",
    "abstract": "Recent advancements in Neural Audio Synthesis (NAS) have outpaced the development of standardized evaluation methodologies and tools. To bridge this gap, we introduce AquaTk, an open-source Python library specifically designed to simplify and standardize the evaluation of NAS systems. AquaTk offers a range of audio quality metrics, including a unique Python implementation of the basic PEAQ algorithm, and operates in multiple modes to accommodate various user needs.",
    "affiliation": "Georgia Institute of Technology",
    "authors": "Vinay, Ashvala*; Lerch, Alexander",
    "authors_emails": "mail@ashvala.net*; alexander.lerch@gatech.edu",
    "channel_name": "lp-16-vinay",
    "channel_url": "https://slack.com/app_redirect?channel=C063SQ2JDJA",
    "paper_link": "https://drive.google.com/file/d/1ArXSEip-EwYcaKsvZkm_MYaJAtmTU_Ox/preview",
    "position": "16",
    "poster_link": "",
    "primary_author": "Ashvala Vinay",
    "primary_email": "mail@ashvala.net",
    "session": "Physical",
    "thumbnail_link": "016.png",
    "title": "AQUATK: An Audio Quality Assessment Toolkit",
    "uid": "330",
    "youtube_id": ""
  },
  {
    "Authors": "Johanna Devaney (Brooklyn College)*; Cecilia Beauchamp (The Bronx High School of Science)",
    "abstract": "This paper presents a new method of encoding performance data in MEI using the recently added <extData> element. Performance data was extracted using the Automatic Music Performance Analysis and Comparison Toolkit (AMPACT) and encoded as a JSON object within an <extData> element linked to a specific musical note. A set of pop music vocals has been encoded to demonstrate both the range of descriptors that can be encoded in <extData> and how this method can be used for transcriptions in the absence of a fully specified musical score. ",
    "affiliation": "The Bronx High School of Science | Brooklyn College",
    "authors": "Devaney, Johanna*; Beauchamp, Cecilia",
    "authors_emails": "johanna.devaney@brooklyn.cuny.edu*; cecebeauchamp21@gmail.com",
    "channel_name": "lp-17-devaney",
    "channel_url": "https://slack.com/app_redirect?channel=C063ZAPV1SP",
    "paper_link": "https://drive.google.com/file/d/1Rqn9ueBnKlplJVahEh2y_5zz6RtVxBD_/preview",
    "position": "17",
    "poster_link": "",
    "primary_author": "Johanna Devaney",
    "primary_email": "johanna.devaney@brooklyn.cuny.edu",
    "session": "Physical",
    "thumbnail_link": "017.png",
    "title": "Encoding performance data in MEI with the Automatic Music Performance Analysis and Comparison Toolkit (AMPACT)",
    "uid": "331",
    "youtube_id": ""
  },
  {
    "Authors": "Nicolas Jonason (KTH Royal Institute of Technology)*; Luca Casini (KTH Royal Institute of Technology); Bob L. T.  Sturm (KTH Royal Institute of Technology)",
    "abstract": "We explore the use of large language models (LLMs) for music generation using a retrieval system to select relevant  examples. We find promising initial results for music generation in a dialogue with the user, especially considering the ease with which such a system can be implemented. The code is available online.",
    "affiliation": "KTH Royal Institute of Technology",
    "authors": "Jonason, Nicolas*; Casini, Luca; Sturm, Bob L. T. ",
    "authors_emails": "nicolasjonason@gmail.com*; casini@kth.se; bobs@kth.se",
    "channel_name": "lp-18-jonason",
    "channel_url": "https://slack.com/app_redirect?channel=C063ZDJKDA6",
    "paper_link": "https://drive.google.com/file/d/1Ch28jptrc8pnYnB4nipgMzsxjPtkpZRz/preview",
    "position": "18",
    "poster_link": "https://drive.google.com/file/d/12uZ8sAvl2jlx7SyqrR3l8wwqz0eD7xsV/preview",
    "primary_author": "Nicolas Jonason",
    "primary_email": "nicolasjonason@gmail.com",
    "session": "Physical",
    "thumbnail_link": "018.png",
    "title": "Retrieval Augmented Generation of Symbolic Music with LLMs",
    "uid": "332",
    "youtube_id": ""
  },
  {
    "Authors": "Haven Kim (KAIST)*; Keunwoo Choi (Gaudio Lab, Inc.); Mateusz Modrzejewski (Warsaw University of Technology); Cynthia C. S. Liem (Delft University of Technology)",
    "abstract": "The equitable distribution of academic data is crucial for ensuring equal research opportunities, and ultimately further progress. Yet, due to the complexity of using the API for audio data that corresponds to the Million Song Dataset along with its misreporting (before 2016) and the discontinuation of this API (after 2016), access to this data has become restricted to those within certain affiliations that are connected peer-to-peer. In this paper, we delve into this issue, drawing insights from the experiences of 22 individuals who either attempted to access the data or played a role in its creation. With this, we hope to initiate more critical dialogue and more thoughtful consideration with regard to access privilege in the MIR community.",
    "affiliation": "Delft University of Technology | KAIST | Gaudio Lab, Inc. | Warsaw University of Technology",
    "authors": "Kim, Haven*; Choi, Keunwoo; Modrzejewski, Mateusz; Liem, Cynthia C. S.",
    "authors_emails": "khaven@kaist.ac.kr*; keunwoo@gaudiolab.com; mateusz.modrzejewski@pw.edu.pl; c.c.s.liem@tudelft.nl",
    "channel_name": "lp-19-kim",
    "channel_url": "https://slack.com/app_redirect?channel=C063SQ34R8W",
    "paper_link": "https://drive.google.com/file/d/1sR1AkQMj2P8E551qpZWPlZhkukPCZbhX/preview",
    "position": "19",
    "poster_link": "",
    "primary_author": "Haven Kim",
    "primary_email": "khaven@kaist.ac.kr",
    "session": "Physical",
    "thumbnail_link": "019.png",
    "title": "The Biased Journey of MSD_AUDIO.ZIP",
    "uid": "334",
    "youtube_id": ""
  },
  {
    "Authors": "Stella Wong (Columbia University)*; Gandalf Hernandez (Columbia University)",
    "abstract": "Despite the importance of musical key detection to computational music understanding, programmatically identifying the tonal center of a musical composition remains a challenging MIR task for modern deep learning systems, resulting in shortcomings in playlist generation and DJ systems. One bottleneck is the lack of availability of reliable tonal center ground truth. Furthermore, deep learning systems that are trained on classical and pop songs exhibit limitations generalizing to other genres. In this paper, we present a new expert-labeled dataset for the evaluation of key detection containing 260 hours (5489 songs) of song-level key and mode annotations, spread across 17 genres. Code for the dataset is made freely available for public use under a Creative Commons license. The dataset’s reusability is enhanced by a bonus script we attach which enables researchers to recreate the dataset as attuned to their individual MIR tasks.",
    "affiliation": "Columbia University",
    "authors": "Wong, Stella*; Hernandez, Gandalf",
    "authors_emails": "stellayinwong@gmail.com*; gandalf.hernandez@gmail.com",
    "channel_name": "lp-20-wong",
    "channel_url": "https://slack.com/app_redirect?channel=C064ND9QML0",
    "paper_link": "https://drive.google.com/file/d/1JGpo5YN93KOsxebPBrD_z4weScslRpE6/preview",
    "position": "20",
    "poster_link": "https://drive.google.com/file/d/1Gw-z0KM59rldYqv5ef1bdTCjxbKOpWwq/preview",
    "primary_author": "Stella Wong",
    "primary_email": "stellayinwong@gmail.com",
    "session": "Physical",
    "thumbnail_link": "020.png",
    "title": "FMAK: A DATASET OF KEY AND MODE ANNOTATIONS FOR THE FREE MUSIC ARCHIVE – EXTENDED ABSTRACT",
    "uid": "335",
    "youtube_id": ""
  },
  {
    "Authors": "YA-HSUAN CHU (National Yang-Ming Chiao-Tung University); Li Su (Academia Sinica)*",
    "abstract": "We have investigated the classification of different textural elements in orchestral symbolic music data. A simple convolutional neural network (CNN) is utilized to perform the classification task in a track-wise and bar-wise manner. Preliminary results are reported, and different training parameters, including the use of contextual data and the combination of tracks, are also discussed. Code and data are available at: https://github.com/YaHsuanChu/orchestraTextureClassification ",
    "affiliation": "Academia Sinica | National Yang-Ming Chiao-Tung University",
    "authors": "CHU, YA-HSUAN; Su, Li*",
    "authors_emails": "yahsuanchu.ee09@nycu.edu.tw; lisu@iis.sinica.edu.tw*",
    "channel_name": "lp-21-chu",
    "channel_url": "https://slack.com/app_redirect?channel=C0641STGVV2",
    "paper_link": "https://drive.google.com/file/d/1J2XFSBWqJubpOiZkdSy-qgt8zmcszu1p/preview",
    "position": "21",
    "poster_link": "https://drive.google.com/file/d/1639jhcBmcsPFEEbbQFFxkZvPxvuPbmlx/preview",
    "primary_author": "Li Su",
    "primary_email": "lisu@iis.sinica.edu.tw",
    "session": "Physical",
    "thumbnail_link": "021.png",
    "title": "Orchestral Texture Classification with Convolution",
    "uid": "336",
    "youtube_id": ""
  },
  {
    "Authors": "Jayeon J. Yi (University of Michigan)*; Sungho Lee (Seoul National University); Kyogu Lee (Seoul National University)",
    "abstract": "In the heart of \"rhythm games\" - games where players must perform actions in sync with a piece of music - are \"charts\", the directives to be given to players. We newly formulate chart generation as a sequence generation problem to train a Transformer using a large dataset. We also introduce tempo-informed preprocessing and training procedures, some of which are suggested to be integral for a successful training. Our model is found to outperform the baselines on a large dataset, and is also found to benefit from pretraining and finetuning.",
    "affiliation": "Seoul National University | University of Michigan",
    "authors": "Yi, Jayeon J.*; Lee, Sungho; Lee, Kyogu",
    "authors_emails": "jayeonyi@umich.edu*; sh-lee@snu.ac.kr; kglee@snu.ac.kr",
    "channel_name": "lp-22-yi",
    "channel_url": "https://slack.com/app_redirect?channel=C063SQ3L17G",
    "paper_link": "https://drive.google.com/file/d/1wBsPrqQRMOPATngJPbBGyNFGtG0UeWMP/preview",
    "position": "22",
    "poster_link": "https://drive.google.com/file/d/1rFYi-3zlubNcJpJtffKvyI_-YwMXKG3t/preview",
    "primary_author": "Jayeon J. Yi",
    "primary_email": "jayeonyi@umich.edu",
    "session": "Physical",
    "thumbnail_link": "022.png",
    "title": "Beat-Aligned Spectrogram-to-Sequence Generation of Rhythm-Game Charts",
    "uid": "337",
    "youtube_id": "https://drive.google.com/uc?export=view&id=133ZaWGSnPCH4cU0mBsHQp3Zqnzg1XKMM"
  },
  {
    "Authors": "Kelvin L Walls (Independant)*; Iran R Roman (NYU); Bea Steers (NYU); Elena Georgieva (NYU)",
    "abstract": "Pitch variability in rap vocals is overlooked in favor of the genre’s uniquely dynamic rhythmic properties. We present an analysis of fundamental frequency (F0) variation in rap vocals over the past 14 years, focusing on song examples that represent the state of modern rap music. Our analy- sis aims at identifying meaningful trends over time, and is in turn a continuation of the 2023 analysis by Georgieva, Ripollés & McFee. They found rap to be an outlier with larger F0 variation compared to other genres, but with a declining trend since the genre’s inception. However, they only analyzed data through 2010. Our analysis looks be- yond 2010. We once again observe rap’s large F0 variation, but with a decelerated decline in recent years.",
    "affiliation": "NYU | Independant",
    "authors": "Walls, Kelvin L*; Roman, Iran R; Steers, Bea; Georgieva, Elena",
    "authors_emails": "kelwalls@gmail.com*; roman@nyu.edu; bsteers@nyu.edu; elena@nyu.edu",
    "channel_name": "lp-23-walls",
    "channel_url": "https://slack.com/app_redirect?channel=C063ZDKFCCS",
    "paper_link": "https://drive.google.com/file/d/1IpGW0WOOE-Hz_32j2zDXku4-e2ipavoT/preview",
    "position": "23",
    "poster_link": "https://drive.google.com/file/d/11LrQ9FOijWZ_GOi_pgFJ2hJH2E5xUVq2/preview",
    "primary_author": "Kelvin L Walls",
    "primary_email": "kelwalls@gmail.com",
    "session": "Physical",
    "thumbnail_link": "023.png",
    "title": "TOTAL VARIATION IN POPULAR RAP VOCALS FROM 2009-2023: EXTENSION OF THE ANALYSIS BY GEORGIEVA, RIPOLLÉS & MCFEE",
    "uid": "338",
    "youtube_id": ""
  },
  {
    "Authors": "Andrew M. Demetriou (Delft University of Technology)*; Jaehun Kim (Pandora / SiriusXM); Sandy Manolios (TU Delft); Cynthia C. S. Liem (Delft University of Technology)",
    "abstract": "This work describes a validated procedure for collecting reference data to estimate personal values from song lyrics. The undertaken work describes our method for sampling songs for lyric annotation, the specific wording and response format of the annotation tool, and estimation of necessary number of annotations per song. We describe two waves of data collection with over 500 respondents each, the first as a method to estimate the necessary number of ratings using 20 songs, and the second to examine the structure of annotations on 360 songs. We show promising similarity in the structure of annotations when compared with the theoretical structure of personal values.",
    "affiliation": "Delft University of Technology | TU Delft | Pandora / SiriusXM",
    "authors": "Demetriou, Andrew M.*; Kim, Jaehun; Manolios, Sandy; Liem, Cynthia C. S.",
    "authors_emails": "andrew.m.demetriou@gmail.com*; jaehun.kim@siriusxm.com; s.manolios@tudelft.nl; c.c.s.liem@tudelft.nl",
    "channel_name": "lp-24-demetriou",
    "channel_url": "https://slack.com/app_redirect?channel=C063ZDKL3SN",
    "paper_link": "https://drive.google.com/file/d/1xCIVdJ8bu3WBWNU0rL3NuCGG-JJ7yjvA/preview",
    "position": "24",
    "poster_link": "https://drive.google.com/file/d/1W3xup0DN-EJ9zJ7NQNy0FaJZi8DN5O58/preview",
    "primary_author": "Andrew M. Demetriou",
    "primary_email": "andrew.m.demetriou@gmail.com",
    "session": "Physical",
    "thumbnail_link": "024.png",
    "title": "TOWARDS AUTOMATED ESTIMATION OF VALUES FROM SONG LYRICS: A DATA COLLECTION PROTOCOL",
    "uid": "339",
    "youtube_id": ""
  },
  {
    "Authors": "ChangHeon Han (Hanyang University )*; Suhyun Lee (Hanyang University); Minsam Ko (Hanyang University)",
    "abstract": "In the composition process, selecting appropriate single-instrumental music sequences and assigning their track-role is an indispensable task. However, manually determining the track-role for a myriad of music samples can be time-consuming and labor-intensive. This study introduces a deep learning model designed to automatically predict the track-role of single-instrumental music sequences. Our evaluations show a prediction accuracy of 87% in the symbolic domain and 84% in the audio domain. The proposed track-role prediction methods hold promise for future applications in AI music generation and analysis.",
    "affiliation": "Hanyang University  | Hanyang University",
    "authors": "Han, ChangHeon*; Lee, Suhyun; Ko, Minsam",
    "authors_emails": "datajedi23@hanyang.ac.kr*; suhyeon00@gmail.com; minsam@hanyang.ac.kr",
    "channel_name": "lp-25-han",
    "channel_url": "https://slack.com/app_redirect?channel=C064NDAK2LQ",
    "paper_link": "https://drive.google.com/file/d/1EjIDSv-dVRUIOTAq_56eMFo75VDhHKiK/preview",
    "position": "25",
    "poster_link": "https://drive.google.com/file/d/16IIOWV6HG34rzIDgJOeNfqz6BXoW8HpH/preview",
    "primary_author": "ChangHeon Han",
    "primary_email": "datajedi23@hanyang.ac.kr",
    "session": "Physical",
    "thumbnail_link": "025.png",
    "title": "Track Role Prediction of Single-Instrumental Sequences",
    "uid": "341",
    "youtube_id": ""
  },
  {
    "Authors": "Nishal S Silva (University of Trento)*; Luca Turchet (University of Trento)",
    "abstract": "",
    "affiliation": "University of Trento",
    "authors": "Silva, Nishal S*; Turchet, Luca",
    "authors_emails": "nishal.silva@unitn.it*; luca.turchet@unitn.it",
    "channel_name": "lp-26-silva",
    "channel_url": "https://slack.com/app_redirect?channel=C064C2XPBJ5",
    "paper_link": "https://drive.google.com/file/d/1Zth4D96_1gIV4NmR6V9nqHq1UygqDulZ/preview",
    "position": "26",
    "poster_link": "https://drive.google.com/file/d/1lEqzPLCw1ddbFTQQUFoXNRXty6QSc5WV/preview",
    "primary_author": "Nishal S Silva",
    "primary_email": "nishal.silva@unitn.it",
    "session": "Physical",
    "thumbnail_link": "026.png",
    "title": "Demo of a smart musical instrument-based real time pattern detection system",
    "uid": "342",
    "youtube_id": "https://drive.google.com/uc?export=view&id=1OGRp2iXM6TMereu_QmqH6Hx_MvoGjjEI"
  },
  {
    "Authors": "Ondřej Cífka (AudioShake)*; Constantinos Dimitriou (AudioShake); Cheng-i Wang (AudioShake); Hendrik Schreiber (AudioShake); Luke Miner (AudioShake); Fabian-Robert Stöter (AudioShake)",
    "abstract": "In this paper, we discuss the evaluation for the automatic lyric transcription (ALT) task. We argue that existing lyric transcription benchmarks, primarily focusing on word content, may overlook the complex nuances of written lyrics. This leads to potential misalignment between the creative process of musicians and songwriters as well as listeners' experiences. For example, the absence of line breaks can strip the lyrics of their original rhythm, emotional emphasis, and rhyme scheme. To address this issue, we introduce JamALT, a new lyrics transcription benchmark based on the JamendoLyrics dataset. This includes an enhanced version of the data, geared specifically towards ALT evaluation by implementing music industry's transcription and formatting guidelines for lyrics, particularly in terms of punctuation, line breaks, letter case, and non-word vocal sounds. We also propose a suite of evaluation metrics beyond traditional word error rate, which are designed to capture the aforementioned issues. We hope that the proposed benchmark contributes to the ALT task, enabling more precise and reliable assessments of transcription systems and enhancing the user experience in lyrics applications such as subtitle renderings for live captioning or karaoke.",
    "affiliation": "AudioShake",
    "authors": "Cífka, Ondřej*; Dimitriou, Constantinos; Wang, Cheng-i; Schreiber, Hendrik; Miner, Luke; Stöter, Fabian-Robert",
    "authors_emails": "ondrej@audioshake.ai*; constantinos@audioshake.ai; cheng-i@audioshake.ai; hendrik@audioshake.ai; luke@audioshake.ai; fabian@audioshake.ai",
    "channel_name": "lp-27-cífka",
    "channel_url": "https://slack.com/app_redirect?channel=C063ZDL4RNE",
    "paper_link": "https://drive.google.com/file/d/1Bc7fG0MrPsnpGiGxW5nXNZVqOVMYwgsq/preview",
    "position": "27",
    "poster_link": "",
    "primary_author": "Ondřej Cífka",
    "primary_email": "ondrej@audioshake.ai",
    "session": "Physical",
    "thumbnail_link": "027.png",
    "title": "Jam-ALT: A Formatting-Aware Lyrics Transcription Benchmark",
    "uid": "343",
    "youtube_id": ""
  },
  {
    "Authors": "Yuexuan KONG (Deezer)*; Romain Hennequin (Deezer Research); Viet-Anh Tran (Deezer)",
    "abstract": "",
    "affiliation": "Deezer | Deezer Research",
    "authors": "KONG, Yuexuan*; Hennequin, Romain; Tran, Viet-Anh",
    "authors_emails": "ykong@deezer.com*; rhennequin@deezer.com; vatran@deezer.com",
    "channel_name": "lp-28-kong",
    "channel_url": "https://slack.com/app_redirect?channel=C064NDB3HQ8",
    "paper_link": "https://drive.google.com/file/d/1IGbmPeJlfENKWa9giJemxpmk4eU6r_MH/preview",
    "position": "28",
    "poster_link": "https://drive.google.com/file/d/1p-PaeAEoEhdPXgtlH7WDv7YdOCNcAoMo/preview",
    "primary_author": "Yuexuan KONG",
    "primary_email": "ykong@deezer.com",
    "session": "Physical",
    "thumbnail_link": "028.png",
    "title": "STraDa: A Singer Traits Dataset",
    "uid": "344",
    "youtube_id": ""
  },
  {
    "Authors": "Jingwei Zhao (National University of Singapore)*; Gus Xia (New York University Shanghai); Ye Wang (National University of Singapore)",
    "abstract": "Style transfer, in the context of music generation, has been primarily enabled through content-style disentanglement. However, a notable limitation of existing disentanglement models is their confinement to short musical clips, typically spanning only a few bars. In this late-breaking demo, we propose and formalize a novel idea of modular style prior modelling to bridge this research gap. Our focus centres on the specific task of accompaniment arrangement, beginning with AccoMontage, a piano arranger that leverages chord-texture disentanglement and a primitive, rule-based style planner to maintain a long-term texture structure. Subsequently, we introduce Q&A-XL, a multi-track orchestrator with a more generic latent style prior model, which characterizes the global structure of orchestration style. From end to end, the complete system is named AccoMontage-3, which is capable of generating full-band accompaniment for whole pieces of music, with cohesive multi-track arrangement and coherent long-term structure.",
    "affiliation": "National University of Singapore | New York University Shanghai",
    "authors": "Zhao, Jingwei*; Xia, Gus; Wang, Ye",
    "authors_emails": "jzhao@u.nus.edu*; gxia@nyu.edu; wangye@comp.nus.edu.sg",
    "channel_name": "lp-29-zhao",
    "channel_url": "https://slack.com/app_redirect?channel=C063ZDLEXEW",
    "paper_link": "https://drive.google.com/file/d/1AsH1nokCxHdh455NdNBC6XPg5AeuKxhj/preview",
    "position": "29",
    "poster_link": "",
    "primary_author": "Jingwei Zhao",
    "primary_email": "jzhao@u.nus.edu",
    "session": "Physical",
    "thumbnail_link": "029.png",
    "title": "Interpretable Modular Representation Learning for Full-Band Accompaniment Arrangement",
    "uid": "345",
    "youtube_id": ""
  },
  {
    "Authors": "Maral Ebrahimzadeh (Otto-von-Guericke-University Magdeburg)*; Valerie Krug (Otto-von-Guericke-University Madgeburg); Sebastian Stober (Otto von Guericke University)",
    "abstract": "Learning the harmonic structure of music is crucial for various music information retrieval (MIR) tasks. Word2vec skip-gram, a well-established technique in natural language processing, has been found to effectively learn harmonic concepts in music. It represents music slices in a vector space, preserving meaningful geometric relationships. These embeddings hold great promise as inputs for MIR tasks, particularly automatic chord recognition (ACR). However, ACR research predominantly focuses on audio data due to the limited availability of well-annotated symbolic music datasets. In this work, we propose an innovative approach utilizing the Harmony Transformer (HT) architecture by Chen and Su. Instead of incorporating input embedding within the network, we leverage skip-gram as an unsupervised embedding technique. Our experiments show that this unsupervised method produces embeddings that adeptly capture harmonic concepts. We also introduce a novel visualization method to assess the fidelity of these embeddings in representing harmonic musical concepts. We perform our experiments on the Lakh MIDI and the BPS-FH dataset.",
    "affiliation": "Otto-von-Guericke-University Madgeburg | Otto von Guericke University | Otto-von-Guericke-University Magdeburg",
    "authors": "Ebrahimzadeh, Maral*; Krug, Valerie; Stober, Sebastian",
    "authors_emails": "maral.ebrahimzadeh@ovgu.de*; valerie.krug@ovgu.de; stober@ovgu.de",
    "channel_name": "lp-30-ebrahimzadeh",
    "channel_url": "https://slack.com/app_redirect?channel=C063ZDLKHUJ",
    "paper_link": "https://drive.google.com/file/d/1-dAeViSpdzK3TqFylh4EflOL3ep524HA/preview",
    "position": "30",
    "poster_link": "",
    "primary_author": "Maral Ebrahimzadeh",
    "primary_email": "maral.ebrahimzadeh@ovgu.de",
    "session": "Physical",
    "thumbnail_link": "030.png",
    "title": "Improving Embeddings in Harmony Transformer",
    "uid": "346",
    "youtube_id": ""
  },
  {
    "Authors": "Longshen Ou (National University of Singapore)*; Xichu Ma (National University of Singapore); Ye Wang (National University of Singapore)",
    "abstract": "",
    "affiliation": "National University of Singapore",
    "authors": "Ou, Longshen*; Ma, Xichu; Wang, Ye",
    "authors_emails": "oulongshen@u.nus.edu*; ma_xichu@u.nus.edu; wangye@comp.nus.edu.sg",
    "channel_name": "lp-31-ou",
    "channel_url": "https://slack.com/app_redirect?channel=C063WFVV353",
    "paper_link": "https://drive.google.com/file/d/1dGJ8XTzTxFIPuJDkxJwJ0jdmko5SjSqG/preview",
    "position": "31",
    "poster_link": "https://drive.google.com/file/d/1roV-FGa10hqYba-9F2Zx6uCy2OieQ1m1/preview",
    "primary_author": "Longshen Ou",
    "primary_email": "oulongshen@u.nus.edu",
    "session": "Physical",
    "thumbnail_link": "031.png",
    "title": "Singable and Controllable Neural Lyric Translation: a Late-Breaking Showcase",
    "uid": "347",
    "youtube_id": ""
  },
  {
    "Authors": "Kamil Akesbi (Deezer Research)*; Benjamin Martin (Deezer); Dorian Desblancs (Deezer)",
    "abstract": "",
    "affiliation": "Deezer | Deezer Research",
    "authors": "Akesbi, Kamil*; Martin, Benjamin; Desblancs, Dorian",
    "authors_emails": "kakesbi@deezer.com*; bmartin@deezer.com; ddesblancs@deezer.com",
    "channel_name": "lp-32-akesbi",
    "channel_url": "https://slack.com/app_redirect?channel=C064NDBP8CQ",
    "paper_link": "https://drive.google.com/file/d/1uSa1o0pdPGS9IVLqG8C1GbmWl0uugC2e/preview",
    "position": "32",
    "poster_link": "https://drive.google.com/file/d/1u9Scgo8FULDmiHBUSduAtZqUYWA_pziV/preview",
    "primary_author": "Kamil Akesbi",
    "primary_email": "kakesbi@deezer.com",
    "session": "Physical",
    "thumbnail_link": "032.png",
    "title": "A Noise Augmentation Pipeline for Realistic Query-By-Example Simulation",
    "uid": "348",
    "youtube_id": ""
  },
  {
    "Authors": "Alessandro I Mezza (Politecnico di Milano )*; Riccardo di Palma (Politecnico di Milano); Edoardo Morena (Politecnico di Milano); Alessandro Orsatti (Politecnico di Milano); Riccardo Giampiccolo (Politecnico di Milano); Alberto Bernardini (Politecnico di Milano); Augusto Sarti (Politecnico di Milano)",
    "abstract": "LARS is an open-source cross-platform VST3 plugin written in C++ and designed for separating a stereo drums mixture into five individual stems. At the core of LARS lies a novel bank of parallel U-Nets pretrained using a collection of over 1224 hours of isolated drum clips, making LARS the first neural-network-based plugin available for drum source separation. Thanks to a competitive real-time ratio and user-friendly interface, LARS emerges as a versatile tool for music producers and engineers alike. These features makes LARS suitable for tasks such as drum replacement, drum loops decomposition, audio restoration, remixing, and remastering. Furthermore, LARS may find its way into contemporary music production workflows by complementing existing music demixing models.",
    "affiliation": "Politecnico di Milano  | Politecnico di Milano",
    "authors": "Mezza, Alessandro I*; di Palma, Riccardo; Morena, Edoardo; Orsatti, Alessandro; Giampiccolo, Riccardo; Bernardini, Alberto; Sarti, Augusto",
    "authors_emails": "alessandroilic.mezza@polimi.it*; riccardo.dipalma@mail.polimi.it; edoardo.morena@mail.polimi.it; alessandro.orsatti@mail.polimi.it; riccardo.giampiccolo@polimi.it; alberto.bernardini@polimi.it; augusto.sarti@polimi.it",
    "channel_name": "lp-33-mezza",
    "channel_url": "https://slack.com/app_redirect?channel=C0641SVF892",
    "paper_link": "https://drive.google.com/file/d/1mvutl-trgN06__8uloCCeq8nVmdgCJl-/preview",
    "position": "33",
    "poster_link": "https://drive.google.com/file/d/1Srp7TxtVq0xfou3gJ46WznjkhC4nvB-X/preview",
    "primary_author": "Alessandro I Mezza",
    "primary_email": "alessandroilic.mezza@polimi.it",
    "session": "Physical",
    "thumbnail_link": "033.png",
    "title": "LARS: An Open-Source VST3 Plug-in for Deep Drums Demixing With Pretrained Models",
    "uid": "349",
    "youtube_id": ""
  },
  {
    "Authors": "Kana Tatsumi (Nagoya Institute of Technology)*; Shinji Sako (Nagoya Institute of Technology); Rafael Ramirez (Universitat Pompeu Fabra )",
    "abstract": "The purpose of this study is to debilitate the enjoyment of music for both hearing-impaired and normal-hearing individuals by visually representing music. In order to effectively and distinctively portray the musical rhythm, we focus on Chironomie, a conducting technique used in Gregorian chant. Generally, Chironomie is drawn by a curve that corresponds to the musical score, and this curve is determined by whether a short segment of the score represents one of two classes: Arsis or Thesis. In pursuit of our objective, our endeavors encompass two essential facets: the adaptation of Chironomie for Western tonal music to express intuitively perceivable musical features like tension and relaxation, and the evaluation whether Chironomie can effectively convey music visually. We report an automated method for estimating Arsis and Thesis within composite beats to generate Chironomie. Additionally, it presents evaluation experiments involving normal-hearing to assess the effectiveness of Chironomie.",
    "affiliation": "Universitat Pompeu Fabra  | Nagoya Institute of Technology",
    "authors": "Tatsumi, Kana*; Sako, Shinji; Ramirez, Rafael",
    "authors_emails": "tatsumi@lee-lab.org*; s.sako@nitech.ac.jp; Rafael.ramirez@upf.edu",
    "channel_name": "lp-34-tatsumi",
    "channel_url": "https://slack.com/app_redirect?channel=C063SQ5JAF8",
    "paper_link": "https://drive.google.com/file/d/1d81e1FNuA4KQ101tmfRZgv_uzcntvnu7/preview",
    "position": "34",
    "poster_link": "https://drive.google.com/file/d/1VR64-Uona5b3PKRx16B8jxfrCj-sLGWG/preview",
    "primary_author": "Kana Tatsumi",
    "primary_email": "tatsumi@lee-lab.org",
    "session": "Physical",
    "thumbnail_link": "034.png",
    "title": "Music Visualization using Chironomie",
    "uid": "350",
    "youtube_id": ""
  },
  {
    "Authors": "Lars L Monstad (University of Oslo)*; Olivier Lartillot (University of Oslo)",
    "abstract": "In the rapidly expanding field of music information retrieval (MIR), automatic transcription remains one of the most sought-after capabilities, especially for songs that employ multiple instruments. Musscribe emerges as a state-of-the-art transcription tool that addresses this challenge by integrating three distinct methodologies: demixing, harmonic dilated convolution, and joint beat tracking. Demixing is employed to isolate individual instruments within a song by separating overlapping audio sources, thus ensuring each instrument is transcribed distinctly. Beat tracking is then run as a parallel process to extract the joint beat and downbeat estimations. These processes results in an output midi file, which is then quantized using information derived from the beat tracking. As such, this method paves the way for more accurate and sophisticated analyses, bridging the gap between human and machine understanding of music. Together, these methodologies allow us to produce transcriptions that are not only accurate but also highly representative of the original compositions. Preliminary tests and evaluations showcase the potential in transcribing complex musical pieces with high fidelity, outperforming many contemporary tools in the market. This innovative approach not only has implications for music transcription but also for broader applications in audio analysis, remixing, and digital music production. The model has been instrumental in accelerating the composition process for several Norwegian television shows. Moreover, its efficacy can be observed in the Netflix series \"A Storm for Christmas.\" Renowned composer Peter Baden harnessed this tool to enhance his workflow, proving the demand for innovative tools like this in the professional music industry. ",
    "affiliation": "University of Oslo",
    "authors": "Monstad, Lars L*; Lartillot, Olivier",
    "authors_emails": "lars.monstad@gmail.com*; o.s.g.lartillot@imv.uio.no",
    "channel_name": "lp-35-monstad",
    "channel_url": "https://slack.com/app_redirect?channel=C063WFWJVNH",
    "paper_link": "https://drive.google.com/file/d/1BtsicT43bP7wFyHIyYIXGV1iK0wbNG0l/preview",
    "position": "35",
    "poster_link": "https://drive.google.com/file/d/169OykNG250k2d73dJd9XalFYeKEQTu8h/preview",
    "primary_author": "Lars L Monstad",
    "primary_email": "lars.monstad@gmail.com",
    "session": "Physical",
    "thumbnail_link": "035.png",
    "title": "AUTOMATIC TRANSCRIPTION OF MULTI-INSTRUMENTAL SONGS: INTEGRATING DEMIXING, HARMONIC DILATED CONVOLUTION, AND JOINT BEAT TRACKING",
    "uid": "351",
    "youtube_id": ""
  },
  {
    "Authors": "Ju-Chiang Wang (ByteDance)*; Wei-Tsung Lu (TikTok); Minz Won (ByteDance)",
    "abstract": "Recently, multi-band spectrogram-based approaches such as Band-Split RNN (BSRNN) have demonstrated promising results for music source separation. In our recent work, we introduce the BS-RoFormer model which inherits the idea of band-split scheme in BSRNN at the front-end, and then uses the hierarchical Transformer with Rotary Position Embedding (RoPE) to model the inner-band and inter-band sequences for multi-band mask estimation. This model has achieved state-of-the-art performance, but the band-split scheme is defined empirically, without analytic supports from the literature. In this paper, we propose Mel-RoFormer, which adopts the Mel-band scheme that maps the frequency bins into overlapped subbands according to the mel scale. In contract, the band-split mapping in BSRNN and BS-RoFormer is non-overlapping and designed based on heuristics. Using the MUSDB18HQ dataset for experiments, we demonstrate that Mel-RoFormer outperforms BS-RoFormer in the separation tasks of vocals, drums, and other stems.",
    "affiliation": "ByteDance | TikTok",
    "authors": "Wang, Ju-Chiang*; Lu, Wei-Tsung; Won, Minz",
    "authors_emails": "ju-chiang.wang@bytedance.com*; weitsung.lu@bytedance.com; minzwon@bytedance.com",
    "channel_name": "lp-36-wang",
    "channel_url": "https://slack.com/app_redirect?channel=C063ZAT4HUK",
    "paper_link": "https://drive.google.com/file/d/1SeS_P8YnbwbwLM3uWFeSHLMwNcZJ_avA/preview",
    "position": "36",
    "poster_link": "https://drive.google.com/file/d/1HyNJON4mmVE_umH2jp06F2Wi896itCY8/preview",
    "primary_author": "Ju-Chiang Wang",
    "primary_email": "ju-chiang.wang@bytedance.com",
    "session": "Physical",
    "thumbnail_link": "036.png",
    "title": "Mel-Band RoFormer for Music Source Separation",
    "uid": "353",
    "youtube_id": "https://drive.google.com/uc?export=view&id=1sB9v9J3KYJXpWY9YSSLvqJt0KqP4nkJr"
  },
  {
    "Authors": "Polina Proutskova (Queen Mary University of London)*; John M McBride (Institute for Basic Science); Yuto Ozaki (Keio University); Gakuto Chiba (Keio University); Yukun Li (Queen Mary University of London); Yu Zhaoxin (Shandong College of Arts); Wei Yue (Shandong College of Arts); Miranda Crowdus (Concordia University); Gabriel Zuckerberg (Brown University); Olga Velichkina (Rench Society for Ethnomusicology); Yulia Nikolaenko (independent); Yannick Wey (Lucerne University of Applied Sciences and Arts); Lawrence Shuster (Cornell University); Patrick E. Savage (Keio University); Elizabeth Phillips (McMaster University); Andrew Killick (University of Sheffield)",
    "abstract": "The VocalNotes dataset is a collection of audio and annotations for excerpts of vocal performances from five musical traditions - Japanese Minyo, Chinese Hebei Bangzi opera, Russian traditional singing, Alpine yodel and Jewish Romaniote chant. For each tradition the dataset contains: about 10 minutes of audio; documentation for the songs from which annotated fragments originate; f0, independent onset, offset and note pitch annotations created by two or three experts; The dataset was created as part of the VocalNotes project [1]. It is released under CC-BY-NC-SA license and can be accessed by filling out a request form.",
    "affiliation": "McMaster University | Brown University | Rench Society for Ethnomusicology | Lucerne University of Applied Sciences and Arts | Keio University | Shandong College of Arts | University of Sheffield | Concordia University | independent | Queen Mary University of London | Institute for Basic Science | Cornell University",
    "authors": "Proutskova, Polina*; McBride, John M; Ozaki, Yuto; Chiba, Gakuto; Li, Yukun; Zhaoxin, Yu; Yue, Wei; Crowdus, Miranda; Zuckerberg, Gabriel; Velichkina, Olga; Nikolaenko, Yulia; Wey, Yannick; Shuster, Lawrence; Savage, Patrick E.; Phillips, Elizabeth; Killick, Andrew",
    "authors_emails": "proutskova@googlemail.com*; jmmcbride@protonmail.com; yozaki@sfc.keio.ac.jp; gane1222@sfc.keio.ac.jp; yukun.li@qmul.ac.uk; 943469149@qq.com; yuewei1981zgyy@126.cm; miranda.crowdus@concordia.ca; gabriel_zuckerberg@brown.edu; olga.velichkina@gmail.com; mitida173@gmail.com; yannick.wey@hslu.ch; lbs239@cornell.edu; psavage@sfc.keio.ac.jp; phille10@mcmaster.ca; a.killick@sheffield.ac.uk",
    "channel_name": "lv-37-proutskova",
    "channel_url": "https://slack.com/app_redirect?channel=C063ZDMPG2E",
    "paper_link": "https://drive.google.com/file/d/1VIcWtjUY0HM94ssTCaZLeAeUCjkH7zUO/preview",
    "position": "37",
    "poster_link": "https://drive.google.com/file/d/1SrktmoICd97VQJcXrZCziqCLVTJ8NE3C/preview",
    "primary_author": "Polina Proutskova",
    "primary_email": "proutskova@googlemail.com",
    "session": "Virtual",
    "thumbnail_link": "037.png",
    "title": "THE VocalNotes DATASET",
    "uid": "354",
    "youtube_id": ""
  },
  {
    "Authors": "André C. Santos (CISUC - UC)*; F. Amilcar Cardoso (University Coimbra)",
    "abstract": "A common, and arguably innate, human response when listening to music is to tap one's foot to mark the regular pulse of the beat. A more complex form of interactive synchronization occurs when listeners tap out rhythmic patterns using their fingers, hands, or even some form of improvised drumsticks.  In this late-breaking demo, we explore this interaction by leveraging the style transfer capabilities of a neural audio synthesis model by training it on a drum dataset and feeding it tapped rhythm recordings at inference time. We also provide a concise and high-level overview of the results, which, in our assessment, not only justify further research but also establish an intriguing baseline for future investigations. Finally, we point out several future research directions.",
    "affiliation": "University Coimbra | CISUC - UC",
    "authors": "Santos, André C.*; Cardoso, F. Amilcar",
    "authors_emails": "andresantos@dei.uc.pt*; amilcar@dei.uc.pt",
    "channel_name": "lp-38-santos",
    "channel_url": "https://slack.com/app_redirect?channel=C063ZDMUCLA",
    "paper_link": "https://drive.google.com/file/d/1hzKEZD6DP-WUyWbY6J2PV7_SIc3kZQGb/preview",
    "position": "38",
    "poster_link": "https://drive.google.com/file/d/1jyF43nHZDdgiFjmJrE6evWFvkDZ7-3LQ/preview",
    "primary_author": "André C. Santos",
    "primary_email": "andresantos@dei.uc.pt",
    "session": "Physical",
    "thumbnail_link": "038.png",
    "title": "From Taps to Drums: Audio-to-audio Percussion Style Transfer",
    "uid": "355",
    "youtube_id": ""
  },
  {
    "Authors": "Sven Hollowell (University of Bristol)*; Tashi Namgyal (University of Bristol); Paul Marshall (University of Bristol)",
    "abstract": "We introduce a system that allows users of Ableton Live to create MIDI-clips by naming them with musical descriptions. Users can compose by typing the desired musical content directly in Ableton's clip view, which is then inserted by our integrated system. This allows users to stay in the flow of their creative process while quickly generating musical ideas. The system works by prompting ChatGPT to reply using one of several text-based musical formats, such as ABC notation, chord symbols, or drum tablature. This is an important step in integrating generative AI tools into pre-existing musical workflows, and could be valuable for content makers who prefer to express their creative vision through descriptive language.",
    "affiliation": "University of Bristol",
    "authors": "Hollowell, Sven*; Namgyal, Tashi; Marshall, Paul",
    "authors_emails": "sven.hollowell@bristol.ac.uk*; tashi.namgyal@bristol.ac.uk; p.marshall@bristol.ac.uk",
    "channel_name": "lp-39-hollowell",
    "channel_url": "https://slack.com/app_redirect?channel=C063JTC8PV5",
    "paper_link": "https://drive.google.com/file/d/14xCaG-5JkcBn4a-WUt3eOkjIZwOKRUoZ/preview",
    "position": "39",
    "poster_link": "https://drive.google.com/file/d/1NSNE5zNzG9AmTH5BMQx6eG8-R-qsFxau/preview",
    "primary_author": "Sven Hollowell",
    "primary_email": "sven.hollowell@bristol.ac.uk",
    "session": "Physical",
    "thumbnail_link": "039.png",
    "title": "JAMMIN-GPT: Text-Based Improvisation Using LLMs in Ableton Live",
    "uid": "356",
    "youtube_id": ""
  },
  {
    "Authors": "Frank Heyen (VISUS, University of Stuttgart)*; Alejandro Gabino Diaz Mendoza (VISUS, University of Stuttgart); Quynh Quang Ngo (VISUS, University of Stuttgart); Michael Sedlmair (Uni Stuttgart)",
    "abstract": "We designed a visual interface for comparing different guitar tablature (tab) versions of the same piece. By automatically aligning the bars of these versions and visually encoding different metrics, our interface helps determine similarity, difficulty, and correctness. During our design, we collected and integrated feedback from musicians and finally conducted a qualitative evaluation with five guitarists. Results confirm that our interface effectively supports comparison and helps musicians choose a version appropriate for their personal skills and tastes.",
    "affiliation": "VISUS, University of Stuttgart | Uni Stuttgart",
    "authors": "Heyen, Frank*; Diaz Mendoza, Alejandro Gabino; Ngo, Quynh Quang; Sedlmair, Michael",
    "authors_emails": "frank.heyen@visus.uni-stuttgart.de*; st180643@stud.uni-stuttgart.de; quynh.ngo@visus.uni-stuttgart.de; Michael.Sedlmair@visus.uni-stuttgart.de",
    "channel_name": "lp-40-heyen",
    "channel_url": "https://slack.com/app_redirect?channel=C063SQ6JA6A",
    "paper_link": "https://drive.google.com/file/d/1KvFlXGEmMjySR_h3lmAz0CDK3thHS3PP/preview",
    "position": "40",
    "poster_link": "",
    "primary_author": "Frank Heyen",
    "primary_email": "frank.heyen@visus.uni-stuttgart.de",
    "session": "Physical",
    "thumbnail_link": "040.png",
    "title": "Visual Guitar Tab Comparison",
    "uid": "357",
    "youtube_id": ""
  },
  {
    "Authors": "Gopika Krishnan (NYU Abu Dhabi)*; Kaustuv Ganguli (NYU Abu Dhabi); Carlos Guedes (NYU Abu Dhabi)",
    "abstract": "In this study, we examined different facets of the mridangam stroke transcription pipeline. We employed datasets comprising of mridangam strokes, some artificially generated through simulations using a browser application in which the strokes can be generated by typing the syllables on a text window, and others recorded authentically. We investigate the effectiveness of clustering techniques on the task of stroke classification. Additionally, pre-trained residual neural networks (ResNet) were also examined by fine-tuning them on the task. Our initial findings, supported by existing literature, underscore the necessity of introducing additional steps to address composite strokes (strokes created by combining two basic strokes) and accommodate full-length recordings of the mridangam. We also delved into the task of audio segmentation using onset detection techniques as part of our broader exploration within this context. Our aim was to segment mridangam recordings into individual strokes. Our preliminary finding suggests that utilizing spectral flux for onset detection, coupled with a post-processing step involving a local average computation step, produced promising results. ",
    "affiliation": "NYU Abu Dhabi",
    "authors": "Krishnan, Gopika*; Ganguli, Kaustuv; Guedes, Carlos",
    "authors_emails": "gk1656@nyu.edu*; kaustuvkanti@nyu.edu; carlos.guedes@nyu.edu",
    "channel_name": "lp-41-krishnan",
    "channel_url": "https://slack.com/app_redirect?channel=C064NDD89EU",
    "paper_link": "https://drive.google.com/file/d/1DhlhRTFYW7AARv3GxmO1J0JZudv3sVa-/preview",
    "position": "41",
    "poster_link": "https://drive.google.com/file/d/1-7w_w2S_7NQ6nzAGcD4xz1La6eGiQLNV/preview",
    "primary_author": "Gopika Krishnan",
    "primary_email": "gk1656@nyu.edu",
    "session": "Physical",
    "thumbnail_link": "041.png",
    "title": "Optimizing the Mridangam Stroke Transcription Pipeline: Addressing Key Challenges",
    "uid": "358",
    "youtube_id": ""
  },
  {
    "Authors": "Yin-Jyun Luo (Queen Mary University of London)*; Simon Dixon (Queen Mary University of London)",
    "abstract": "In this preliminary study, we investigate the ability of disentangled sequential autoencoders, an unsupervised deep-generative model, to learn representations of the voice timbre for the task of speaker or singer verification. Despite its simplicity, the framework yields promising performance, and we plan to conduct a comprehensive benchmark with state-of-the-art self-supervised learning models.",
    "affiliation": "Queen Mary University of London",
    "authors": "Luo, Yin-Jyun*; Dixon, Simon",
    "authors_emails": "yin-jyun.luo@qmul.ac.uk*; s.e.dixon@qmul.ac.uk",
    "channel_name": "lv-42-luo",
    "channel_url": "https://slack.com/app_redirect?channel=C064HKGJ06Q",
    "paper_link": "https://drive.google.com/file/d/1VMrQVBTxKzKi6FZKAq82nQ8xTAgh4nY0/preview",
    "position": "42",
    "poster_link": "https://drive.google.com/file/d/1f37xw4vKwM0tWAD0FX6fNkNHRw0tLPLX/preview",
    "primary_author": "Yin-Jyun Luo",
    "primary_email": "yin-jyun.luo@qmul.ac.uk",
    "session": "Virtual",
    "thumbnail_link": "042.png",
    "title": "SPEAKER AND SINGER VERIFICATION USING A DISENTANGLED VOCAL TIMBRE REPRESENTATION",
    "uid": "359",
    "youtube_id": ""
  },
  {
    "Authors": "Matevž Pesek (University of Ljubljana)*; Matija Podbreznik (University of Ljubljana); Peter Šavli (Conservatory for music and ballet, Ljubljana); Matija Marolt (University of Ljubljana)",
    "abstract": "We present two inverted dictation ear training games, now included in the upgraded Troubadour platform for music theory learning. The Troubadour platform offers e-learning games for ear training in rhythm, intervals and harmonies in an open-sourced and user-centred environment. With now added inverted dictation games, the platform offers a new modality of ear training, which enables the students to practice their voice or instruments individually without the necessity of the teacher's presence while practicing.",
    "affiliation": "Conservatory for music and ballet, Ljubljana | University of Ljubljana",
    "authors": "Pesek, Matevž*; Podbreznik, Matija; Šavli, Peter; Marolt, Matija",
    "authors_emails": "matevz.pesek@fri.uni-lj.si*; mp0685@student.uni-lj.si; peter.savli@kgbl.si; matija.marolt@fri.uni-lj.si",
    "channel_name": "lv-43-pesek",
    "channel_url": "https://slack.com/app_redirect?channel=C0640L6KRST",
    "paper_link": "https://drive.google.com/file/d/1OloK4iEPeuPnZc_Y_3dKzqH6P3JWq20l/preview",
    "position": "43",
    "poster_link": "",
    "primary_author": "Matevž Pesek",
    "primary_email": "matevz.pesek@fri.uni-lj.si",
    "session": "Virtual",
    "thumbnail_link": "043.png",
    "title": "Inverted dictation games for home and remote ear training",
    "uid": "360",
    "youtube_id": ""
  },
  {
    "Authors": "Liwei Lin (New York University Shanghai)*; Guangyu Xia (NYU Shanghai); Junyan Jiang (New York University Shanghai); Yixiao Zhang (Queen Mary University of London)",
    "abstract": "We propose \\textit{Coco-Mulla}, a plug-and-play module that adds direct content-based controls (chords, drums, and piano-roll) to existing text-to-music large language models, e.g.  MusicGen. Coco-Mulla employs the Parameter-Efficient Fine-Tuning (PEFT) method, which only requires fine-tuning with fewer than 4\\% of the original model's parameters on a dataset containing fewer than 300 songs. Experiments show that our approach achieves effective content-based controls while keeping the quality of generated music. Furthermore, by combining content-based controls and text descriptions, our system achieves flexible music variation generation and style transfer. \\footnote{Our source codes and demos are available at \\url{https://kikyo-16.github.io/coco-mulla}.}",
    "affiliation": "NYU Shanghai | Queen Mary University of London | New York University Shanghai",
    "authors": "Lin, Liwei*; Xia, Guangyu; Jiang, Junyan; Zhang, Yixiao",
    "authors_emails": "linliwei3916@gmail.com*; pkuxgy@gmail.com; at2jjy@gmail.com; ldzhangyx@outlook.com",
    "channel_name": "lv-44-lin",
    "channel_url": "https://slack.com/app_redirect?channel=C064F6S0NUA",
    "paper_link": "https://drive.google.com/file/d/19S9qbuJeSHtJ25NkuW1sht8Z4VlNx-Hp/preview",
    "position": "44",
    "poster_link": "",
    "primary_author": "Liwei Lin",
    "primary_email": "linliwei3916@gmail.com",
    "session": "Virtual",
    "thumbnail_link": "044.png",
    "title": "Equipping MusicGen with Chord and Rhythm Controls",
    "uid": "361",
    "youtube_id": "https://drive.google.com/uc?export=view&id=1zyhZaJKKud7llIO0J9eiPTEpwSg7phR1"
  },
  {
    "Authors": "Emre Sarigöl (Utopia Music)*; Steffen Reetz (Utopia Music ); Rui Hu (Utopia Music); Thomas Lidy (Utopia Music)",
    "abstract": "The proliferation of Large Language Models (LLMs) has significantly revolutionized Natural Language Processing. At Utopia, we developed “Enhance Lyrics”, a lyrics-based mood/theme detection and keyword generation tool, which combines predictions from LLMs with  smaller transformer models. Specifically, instead of fine tuning the LLMs for our downstream tasks, we use them in a zero-shot fashion, followed by a much smaller  transformer finetuned with our downstream task datasets. Our research suggests a hybrid approach can enhance performance compared to leveraging only LLMs. ",
    "affiliation": "Utopia Music | Utopia Music ",
    "authors": "Sarigöl, Emre*; Reetz, Steffen; Hu, Rui; Lidy, Thomas",
    "authors_emails": "emre.sarigol@utopiamusic.com*; steffen.reetz@utopiamusic.com; rui.hu@utopiamusic.com; thomas.lidy@utopiamusic.com",
    "channel_name": "lv-45-sarigöl",
    "channel_url": "https://slack.com/app_redirect?channel=C0648HHC89L",
    "paper_link": "https://drive.google.com/file/d/1n1x4JlGuAnl0yV7zNs2uTvYxKzgm-mWo/preview",
    "position": "45",
    "poster_link": "https://drive.google.com/file/d/17ANS9VsWujCRgHNGy96DBLBK_PlH-Jya/preview",
    "primary_author": "Emre Sarigöl",
    "primary_email": "emre.sarigol@utopiamusic.com",
    "session": "Virtual",
    "thumbnail_link": "045.png",
    "title": "ENHANCE LYRICS: Blending Large and Small Transformers for in-depth Song Analysis",
    "uid": "362",
    "youtube_id": "https://drive.google.com/uc?export=view&id=1ibmG5BDCSX2IQfEDuGzi0KIHTwN7_9HW"
  },
  {
    "Authors": "Haokun Tian (Queen Mary University of London)*; Kun Liu (Xiaohongshu Inc.); Magdalena Fuentes (New York University)",
    "abstract": "It is standard practice to use spectrograms as input features for discriminating MIR tasks. However, recent research showed using representations produced by Jukebox (a music language model) led to better model performance. This was tested on music tagging, genre classification, key detection, emotion recognition, and music transcription. In this paper, we test it on beat and downbeat tracking. Specifically, we compare compressed Jukebox embeddings with spectrograms as input to a model that jointly predicts beat, downbeat, and tempo. Experiments show that the two inputs bring comparable results for beat tracking, while using Jukebox embeddings leads to significant improvements for downbeat tracking.",
    "affiliation": "New York University | Xiaohongshu Inc. | Queen Mary University of London",
    "authors": "Tian, Haokun*; Liu, Kun; Fuentes, Magdalena",
    "authors_emails": "haokun.tian@qmul.ac.uk*; liukun@xiaohongshu.com; mfuentes@nyu.edu",
    "channel_name": "lv-46-tian",
    "channel_url": "https://slack.com/app_redirect?channel=C0640LXA1D5",
    "paper_link": "https://drive.google.com/file/d/12iEm6Tk5tYJkgQXX2nRUyUKy-wtd68HE/preview",
    "position": "46",
    "poster_link": "https://drive.google.com/file/d/1rtZ0PNWeph_gBMNKjw7trLvTELT9Gkd4/preview",
    "primary_author": "Haokun Tian",
    "primary_email": "haokun.tian@qmul.ac.uk",
    "session": "Virtual",
    "thumbnail_link": "046.png",
    "title": "BEAT AND DOWNBEAT TRACKING WITH GENERATIVE EMBEDDINGS",
    "uid": "363",
    "youtube_id": ""
  },
  {
    "Authors": "Yu-Hua Chen (National Taiwan University)*; Woosung Choi (Sony AI); WeiHsiang Liao (Sony Group Corporation); Marco A Martinez Ramirez (Sony Group Corporation); Kin Wai Cheuk (Sony Group Corporation); Yi-Hsuan Yang (National Taiwan University); Yuki Mitsufuji (Sony Group Corporation)",
    "abstract": "In recent years, the application of deep learning methods to guitar effect modelling has garnered considerable attention. Motivated by recent advancements in neural vocoders, we experimented with two different discriminator architectures in replacement of the discriminator employed in an existing GAN-based guitar amplifier modelling framework, for better audio quality. We report the preliminary result of evaluating these methods on the audio samples of 3 amplifiers from the EGDB dataset.",
    "affiliation": "Sony Group Corporation | National Taiwan University | Sony AI",
    "authors": "Chen, Yu-Hua*; Choi, Woosung; Liao, WeiHsiang; Martinez Ramirez, Marco A; Cheuk, Kin Wai; Yang, Yi-Hsuan; Mitsufuji, Yuki",
    "authors_emails": "f08946011@ntu.edu.tw*; Woosung.Choi@sony.com; weihsiang.liao@sony.com; marco.martinez@sony.com; kinwai.cheuk@sony.com; affige@gmail.com; Yuhki.Mitsufuji@sony.com",
    "channel_name": "lv-47-chen",
    "channel_url": "https://slack.com/app_redirect?channel=C0640M3HKM5",
    "paper_link": "https://drive.google.com/file/d/1L5jhq9c5xon-EtnXlABh1lj2htN_vOKv/preview",
    "position": "47",
    "poster_link": "https://drive.google.com/file/d/1OIzrZP8HpyLxYuMON2bvlRE0Ty7iye28/preview",
    "primary_author": "Yu-Hua Chen",
    "primary_email": "f08946011@ntu.edu.tw",
    "session": "Virtual",
    "thumbnail_link": "047.png",
    "title": "Neural Amplifier Modelling with several GAN variants",
    "uid": "364",
    "youtube_id": "https://drive.google.com/uc?export=view&id=1iRgMDVgoP9aF8JEiqPPyp96wTvBYBA7s"
  },
  {
    "Authors": "Akira Maezawa (Yamaha Corporation)*",
    "abstract": "We present an automatic accompaniment method for lead sheets, allowing a user to play along to a favorite piece of music in a semi-improvised manner. We realize this by combining a score follower with a downbeat phase tracker, using a score follower to track at a harmony level, while the exact position inside the measure is narrowed down by a downbeat tracker. The two information sources are fused by model averaging. To prevent the downbeat tracker from tracking tempi at octaves of the correct tempo, the downbeat tracker is conditioned on the target bpm of the performance. We will present a live demo.",
    "affiliation": "Yamaha Corporation",
    "authors": "Maezawa, Akira*",
    "authors_emails": "akira.maezawa@music.yamaha.com*",
    "channel_name": "lv-48-maezawa",
    "channel_url": "https://slack.com/app_redirect?channel=C0640M96615",
    "paper_link": "https://drive.google.com/file/d/1t7IGJaipOjjTMIwGrDAtv7VRNRMWc1vv/preview",
    "position": "48",
    "poster_link": "https://drive.google.com/file/d/1tVAEx2Z1PBWWQx0u1gbfh4aBXVbHAVx2/preview",
    "primary_author": "Akira Maezawa",
    "primary_email": "akira.maezawa@music.yamaha.com",
    "session": "Virtual",
    "thumbnail_link": "048.png",
    "title": "AUTOMATIC ACCOMPANIMENT FROM A LEAD-SHEET BY JOINTLY TRACKING AT CHORD AND DOWNBEAT LEVEL",
    "uid": "365",
    "youtube_id": ""
  }
]
